<?php

return [
    'units' => [
        '小时' => 'hr',
        '时' => 'hr',
        '秒钟' => 's',
        '秒' => 's',
        '分钟' => 'min',
        '分' => 'min',
        '年' => 'year',
        '月' => 'month',
        '周' => 'week',
        '星期' => 'week',
        '天' => 'day',
        '日' => 'day',
        '开尔文' => 'k',
        '摄氏度' => 'c',
        '摄氏' => 'c',
        '华氏度' => 'f',
        '华氏' => 'f',
        '米' => 'm',
        '公尺' => 'm',
        '千米' => 'km',
        '公里' => 'km',
        '厘米' => 'cm',
        '公分' => 'cm',
        '毫米' => 'mm',
        '微米' => 'μm',
        '英里每小时' => 'mph',
        '公里每小时' => 'kph',
        '千米每小时' => 'kph',
        '米每秒' => 'mps',
        '节' => 'knot',
        '英里' => 'mi',
        '海里' => 'nmi',
        '码' => 'yd',
        '英尺' => 'ft',
        '英寸' => 'in',
        '升' => 'l',
        '毫升' => 'ml',
        '品脱' => 'pt',
        '加仑' => 'gal',
        '克' => 'g',
        '千克' => 'kg',
        '公斤' => 'kg',
        '毫克' => 'mg',
        '盎司' => 'oz',
        '磅' => 'lb',
        '瓦' => 'w',
        '千瓦' => 'kw',
        '马力' => 'ps',

        'stop_words' => ['到', '换算成', '换算为', '转为', '等于']
    ],
    'datastorage' => [
        '字节' => 'b',
        '千字节' => 'kb',
        '兆字节' => 'mb',
        '吉字节' => 'gb',
        '太字节' => 'tb',
        '拍字节' => 'pb',
        '艾字节' => 'eb',
        '泽字节' => 'zb',
        '尧字节' => 'yb',
        '吉比字节' => 'gib',
        '兆比字节' => 'mib',
        '太比字节' => 'tib',

        'stop_words' => ['到', '换算成', '换算为', '转为', '等于']
    ],
    'time' => [
        '现在' => 'now',
        '加' => '+',
        '减' => '-',
        '明天' => '+1 day',
        '昨天' => '-1 day',
        '工作日' => 'weekdays',

        'until' => ['直到', '到'],
        'between' => ['之间', '介于'],
        'start of' => ['开始于', '开始'],
        'end of' => ['结束于', '结束'],

        'stop_words' => ['在', '于', '到']
    ],
    'currency' => [
        '人民币' => 'CNY',
        '元' => 'CNY',
        '块' => 'CNY',
        '美元' => 'USD',
        '美金' => 'USD',
        '欧元' => 'EUR',
        '日元' => 'JPY',
        '日币' => 'JPY',
        '港币' => 'HKD',
        '英镑' => 'GBP',
        '加元' => 'CAD',
        '澳元' => 'AUD',
        '韩元' => 'KRW',
        '韩币' => 'KRW',
        '新台币' => 'TWD',
        '泰铢' => 'THB',

        'stop_words' => ['到', '兑', '换算成', '换算为', '等于']
    ],
    'crypto_currency' => [
        '聪' => 'SAT',
        '比特币' => 'BTC',
        '以太坊' => 'ETH',
        '以太币' => 'ETH',

        'stop_words' => ['到', '兑', '换算成', '换算为', '等于']
    ],
    'percentage' => [
        '加' => '+',
        '减' => '-',
        '占' => '%',

        'stop_words' => ['的', '占']
    ],
    'vat' => [
        '加' => '+',
        '减' => '-',
        '税' => 'VAT',
        '增值税' => 'VAT',

        'stop_words' => ['的']
    ],
    'color' => [
        'stop_words' => ['到', '转为', '等于']
    ]
];
